#+TITLE: Todos for cpgd project

* MNIST
** L1
*** Plain
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/mnist/test_l1_plain')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [2, 4, 6, 8, 10]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|-----------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| name                                                            | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_2.00 | acc_l1_4.00 | acc_l1_6.00 | acc_l1_8.00 | acc_l1_10.00 |       l1 |  l1_corr |
|-----------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| mnist_plain_100k_normal_min10_max100_c10_tol5e-3steng-gpu0      |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.505701 |       0.933 |       0.741 |       0.416 |       0.211 |         0.07 | 5.814538 | 5.891123 |
| mnist_plain_100k_normal_min10_max100_c1_tol5e-3steng-gpu0       |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.50572 |       0.933 |       0.743 |       0.416 |       0.209 |         0.07 | 5.816682 | 5.893295 |
| mnist_plain_100k_zeros_min10_max100_c10_tol5e-3steng-gpu0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.505627 |       0.933 |       0.743 |       0.415 |       0.213 |        0.071 | 5.818787 | 5.895428 |
| mnist_plain_100k_zeros_min10_max100_c100_tol5e-3steng-gpu0      |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.505537 |       0.933 |        0.74 |       0.416 |       0.208 |        0.067 |  5.81913 | 5.895775 |
| mnist_plain_100k_zeros_min10_max100_c1_tol5e-3steng-gpu0        |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.505674 |       0.933 |       0.745 |       0.415 |       0.211 |        0.067 | 5.820012 | 5.896668 |
| mnist_plain_100k_normal_min10_max100_c100_tol5e-3steng-gpu0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.505662 |       0.933 |       0.741 |       0.413 |       0.209 |         0.07 |   5.8211 |  5.89777 |
| mnist_plain_100k_normal_min10_max100_c100_tol3.9e-3_steng-gpu_0 |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.505561 |       0.933 |       0.743 |       0.413 |       0.212 |        0.073 | 5.829545 | 5.906327 |
| mnist_plain_10k_normal_min10_max100_c1_tol1e-2_steng-gpu_0      |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.507584 |       0.935 |       0.749 |       0.437 |       0.212 |        0.073 | 5.907861 | 5.985674 |
| mnist_plain_10k_normal_min10_max100_c1_tol5e-3steng-gpu0        |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.507072 |       0.936 |       0.751 |        0.43 |       0.216 |        0.072 | 5.909464 |   5.9873 |
| mnist_plain_10k_normal_min10_max100_c10_tol5e-3steng-gpu0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.506961 |       0.934 |       0.751 |       0.429 |       0.219 |        0.078 | 5.911056 | 5.988912 |
| mnist_plain_10k_zeros_min10_max100_c10_tol5e-3steng-gpu0        | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.507054 |       0.935 |       0.751 |       0.428 |       0.221 |        0.079 | 5.915896 | 5.993815 |
| mnist_plain_10k_zeros_min10_max100_c1_tol5e-3steng-gpu0         |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.506854 |       0.935 |       0.754 |       0.428 |       0.222 |        0.077 | 5.916399 | 5.994325 |
| mnist_plain_10k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.507568 |       0.939 |       0.749 |       0.431 |       0.216 |        0.078 |  5.92214 | 6.000142 |
| mnist_plain_10k_normal_min10_max100_c10_tol3.9e-3_steng-gpu_0   |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.50688 |       0.937 |       0.757 |       0.431 |       0.223 |        0.075 |  5.92255 | 6.000557 |
| mnist_plain_10k_zeros_min10_max100_c1_tol3.9e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.507004 |       0.936 |       0.757 |       0.427 |        0.22 |        0.076 | 5.922645 | 6.000654 |
| mnist_plain_10k_normal_min10_max100_c1_tol3.9e-3_steng-gpu_0    |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.506995 |       0.935 |       0.755 |       0.432 |       0.219 |        0.076 | 5.923045 | 6.001059 |
| mnist_plain_10k_zeros_min10_max100_c100_tol5e-3steng-gpu0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.506948 |       0.934 |       0.751 |       0.429 |       0.219 |        0.077 | 5.928324 | 6.006408 |
| mnist_plain_10k_zeros_min10_max100_c10_tol3.9e-3_steng-gpu_0    |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.506832 |       0.937 |       0.757 |        0.43 |        0.22 |        0.074 |  5.93084 | 6.008957 |
| mnist_plain_10k_normal_min10_max100_c100_tol3.9e-3_steng-gpu_0  |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.50678 |       0.936 |       0.755 |       0.432 |       0.226 |        0.081 | 5.935637 | 6.013817 |
| mnist_plain_10k_zeros_min10_max100_c100_tol3.9e-3_steng-gpu_0   |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.506883 |       0.938 |       0.756 |       0.432 |       0.222 |         0.08 | 5.937716 | 6.015923 |
| mnist_plain_10k_normal_min10_max100_c100_tol5e-3steng-gpu0      | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.507085 |       0.937 |       0.755 |        0.43 |       0.221 |        0.082 | 5.944565 | 6.022862 |
| mnist_plain_100k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0      |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.508195 |       0.944 |       0.773 |       0.454 |       0.228 |        0.081 | 6.048704 | 6.128373 |
| mnist_plain_100k_normal_min10_max100_c10_tol1e-3_steng-gpu_0    |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.50789 |       0.944 |       0.774 |       0.457 |       0.225 |        0.081 | 6.048834 | 6.128505 |
| mnist_plain_100k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.507805 |       0.944 |       0.773 |       0.452 |       0.228 |        0.081 | 6.048893 | 6.128565 |
| mnist_plain_100k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0    | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.508159 |       0.945 |       0.768 |       0.453 |       0.226 |        0.083 | 6.050655 |  6.13035 |
| mnist_plain_100k_normal_min10_max100_c1_tol1e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.507941 |       0.944 |       0.772 |       0.456 |       0.228 |        0.083 | 6.050773 | 6.130468 |
| mnist_plain_100k_normal_min10_max100_c100_tol1e-3_steng-gpu_0   |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.508332 |       0.944 |       0.772 |       0.456 |       0.229 |         0.08 | 6.052961 | 6.132686 |
| mnist_plain_10k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0      |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.50897 |       0.945 |       0.785 |       0.471 |       0.242 |        0.087 |  6.14642 | 6.227376 |
| mnist_plain_10k_normal_min10_max100_c10_tol1e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509559 |       0.945 |       0.784 |       0.477 |       0.242 |         0.09 |  6.15275 | 6.233788 |
| mnist_plain_10k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.508977 |       0.945 |       0.784 |       0.477 |       0.245 |        0.092 | 6.153762 | 6.234815 |
| mnist_plain_10k_normal_min10_max100_c1_tol1e-3_steng-gpu_0      | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.508916 |       0.945 |       0.785 |       0.478 |       0.239 |         0.09 | 6.154163 | 6.235221 |
| mnist_plain_10k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0     | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.509592 |       0.943 |       0.775 |       0.468 |        0.24 |        0.094 | 6.155679 | 6.236756 |
| mnist_plain_10k_normal_min10_max100_c100_tol1e-3_steng-gpu_0    |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509569 |       0.943 |       0.783 |       0.475 |       0.245 |        0.093 | 6.159025 | 6.240147 |
| mnist_plain_1k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0        |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.511362 |       0.944 |       0.776 |       0.483 |       0.246 |        0.101 | 6.180048 | 6.261447 |
| mnist_plain_1k_zeros_min10_max100_c1_tol5e-3steng-gpu0          | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.510076 |       0.939 |       0.774 |       0.483 |       0.249 |        0.093 | 6.192041 | 6.273598 |
| mnist_plain_1k_normal_min10_max100_c1_tol1e-2_steng-gpu_0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.511873 |       0.941 |       0.778 |       0.481 |       0.249 |          0.1 | 6.193862 | 6.275443 |
| mnist_plain_1k_normal_min10_max100_c1_tol5e-3_steng-gpu0        |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.510273 |       0.939 |       0.778 |       0.477 |        0.25 |        0.106 | 6.208652 | 6.290427 |
| mnist_plain_1k_zeros_min10_max100_c1_tol3.9e-3_steng-gpu_0      |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.510133 |       0.939 |        0.78 |       0.479 |       0.251 |          0.1 | 6.213156 | 6.294991 |
| mnist_plain_1k_normal_min10_max100_c1_tol3.9e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509832 |       0.938 |       0.782 |       0.484 |       0.256 |        0.105 |  6.21894 | 6.300851 |
| mnist_plain_1k_zeros_min10_max100_c10_tol3.9e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.50938 |        0.94 |       0.778 |       0.483 |       0.259 |        0.109 | 6.251757 | 6.334101 |
| mnist_plain_1k_zeros_min10_max100_c10_tol5e-3steng-gpu0         |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.510268 |        0.94 |       0.776 |       0.493 |       0.261 |        0.109 | 6.264163 | 6.346669 |
| mnist_plain_1k_normal_min10_max100_c10_tol5e-3_steng-gpu0       |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509665 |       0.942 |       0.785 |       0.483 |       0.265 |        0.111 | 6.272836 | 6.355458 |
| mnist_plain_1k_normal_min10_max100_c10_tol3.9e-3_steng-gpu_0    | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.509626 |       0.941 |        0.79 |       0.481 |       0.264 |        0.112 | 6.275284 | 6.357937 |
| mnist_plain_1k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0       |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.51133 |       0.946 |       0.801 |       0.515 |       0.288 |         0.12 | 6.433056 | 6.517787 |
| mnist_plain_1k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0        |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.512333 |       0.946 |       0.802 |       0.523 |       0.285 |        0.109 | 6.440525 | 6.525355 |
| mnist_plain_1k_normal_min10_max100_c1_tol1e-3_steng-gpu_0       | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.512223 |       0.946 |       0.804 |       0.519 |       0.281 |        0.118 | 6.447391 | 6.532311 |
| mnist_plain_1k_normal_min10_max100_c10_tol1e-3_steng-gpu_0      |  1.08161 | 0.987 | 0.996123 |    0.0 |  0.51113 |       0.946 |       0.806 |       0.514 |       0.286 |        0.116 | 6.451864 | 6.536843 |
| mnist_plain_1k_zeros_min10_max100_c100_tol3.9e-3_steng-gpu_0    |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509072 |       0.946 |       0.826 |       0.571 |       0.356 |        0.173 | 6.930714 |    7.022 |
| mnist_plain_1k_normal_min10_max100_c100_tol3.9e-3_steng-gpu_0   |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509299 |       0.946 |       0.828 |       0.569 |        0.35 |        0.177 | 6.935522 |  7.02687 |
| mnist_plain_1k_normal_min10_max100_c100_tol5e-3_steng-gpu0      |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509837 |       0.944 |       0.828 |       0.586 |       0.352 |         0.18 | 6.991179 | 7.083261 |
| mnist_plain_1k_normal_min10_max100_c100_tol1e-3_steng-gpu_0     |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.509027 |       0.947 |       0.834 |       0.573 |       0.346 |        0.175 | 7.009133 | 7.101452 |
| mnist_plain_1k_zeros_min10_max100_c100_tol5e-3steng-gpu0        |  1.08161 | 0.987 | 0.996123 |    0.0 | 0.508868 |       0.945 |       0.823 |       0.582 |       0.348 |        0.181 | 7.021859 | 7.114346 |
| mnist_plain_1k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0      | 1.081616 | 0.987 | 0.996124 |    0.0 | 0.508966 |       0.949 |       0.833 |       0.579 |       0.346 |        0.178 | 7.055441 |  7.14837 |
|-----------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|

|-------------------------------------------+----------+-------+--------+------------+------------+------------+------------+-------------+----------+----------|
| name                                      | nll_loss |   acc | acc_l1 | acc_l1_2.0 | acc_l1_4.0 | acc_l1_6.0 | acc_l1_8.0 | acc_l1_10.0 |       l1 |  l1_corr |
|-------------------------------------------+----------+-------+--------+------------+------------+------------+------------+-------------+----------+----------|
| mnist_plain_1000000_normal_min10_max100_0 | 1.081616 | 0.987 |    0.0 |      0.933 |      0.737 |      0.412 |      0.204 |       0.066 | 5.777193 | 5.853285 |
| mnist_plain_1000000_zeros_min10_max100_0  | 1.081616 | 0.987 |    0.0 |      0.933 |      0.737 |      0.412 |      0.205 |       0.069 | 5.781183 | 5.857327 |
| mnist_plain_100000_normal_min10_max100_0  |  1.08161 | 0.987 |    0.0 |      0.934 |      0.742 |      0.414 |      0.208 |       0.071 | 5.811951 | 5.888501 |
| mnist_plain_100000_zeros_min10_max100_0   | 1.081616 | 0.987 |    0.0 |      0.933 |      0.741 |      0.411 |       0.21 |       0.069 | 5.816236 | 5.892843 |
| mnist_plain_10000_normal_min10_max100_0   | 1.081616 | 0.987 |    0.0 |      0.938 |      0.756 |       0.43 |       0.22 |       0.081 | 5.930463 | 6.008574 |
| mnist_plain_10000_zeros_min10_max100_0    | 1.081616 | 0.987 |    0.0 |      0.938 |      0.749 |      0.438 |      0.221 |       0.075 | 5.946699 | 6.025024 |
|-------------------------------------------+----------+-------+--------+------------+------------+------------+------------+-------------+----------+----------|

*** L-inf
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/mnist/test_l1_linf')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [2.5, 5, 7.5, 10, 12.5]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|--------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| name                                                         | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_2.50 | acc_l1_5.00 | acc_l1_7.50 | acc_l1_10.00 | acc_l1_12.50 |       l1 |  l1_corr |
|--------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| mnist_linf_100k_normal_min10_max100_c10_tol5e-3steng-gpu0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492904 |       0.355 |       0.023 |         0.0 |          0.0 |          0.0 | 2.194134 | 2.227547 |
| mnist_linf_100k_zeros_min10_max100_c1_tol5e-3steng-gpu0      | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492766 |       0.351 |       0.025 |       0.001 |          0.0 |          0.0 | 2.194946 | 2.228372 |
| mnist_linf_100k_normal_min10_max100_c100_tol5e-3steng-gpu0   | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492313 |       0.355 |       0.024 |       0.001 |          0.0 |          0.0 | 2.195267 | 2.228698 |
| mnist_linf_100k_normal_min10_max100_c1_tol5e-3steng-gpu0     | 0.355685 | 0.985 | 0.981899 |    0.0 |  0.49263 |       0.354 |       0.023 |         0.0 |          0.0 |          0.0 | 2.196117 | 2.229561 |
| mnist_linf_100k_zeros_min10_max100_c10_tol5e-3steng-gpu0     | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492497 |       0.352 |       0.026 |         0.0 |          0.0 |          0.0 | 2.197297 | 2.230758 |
| mnist_linf_100k_zeros_min10_max100_c100_tol5e-3steng-gpu0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492963 |       0.357 |       0.023 |         0.0 |          0.0 |          0.0 | 2.198338 | 2.231815 |
| mnist_linf_10k_normal_min10_max100_c1_tol5e-3steng-gpu0      | 0.355673 | 0.985 | 0.981898 |    0.0 | 0.493189 |       0.378 |        0.03 |       0.001 |          0.0 |          0.0 | 2.273742 | 2.308367 |
| mnist_linf_10k_zeros_min10_max100_c1_tol5e-3steng-gpu0       | 0.355673 | 0.985 | 0.981898 |    0.0 |  0.49351 |       0.379 |       0.029 |       0.001 |          0.0 |          0.0 | 2.277897 | 2.312586 |
| mnist_linf_10k_zeros_min10_max100_c10_tol5e-3steng-gpu0      | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492687 |       0.376 |       0.032 |       0.002 |          0.0 |          0.0 | 2.280566 | 2.315295 |
| mnist_linf_10k_normal_min10_max100_c10_tol5e-3steng-gpu0     | 0.355673 | 0.985 | 0.981898 |    0.0 | 0.492207 |       0.392 |        0.03 |       0.001 |          0.0 |          0.0 | 2.288592 | 2.323444 |
| mnist_linf_10k_normal_min10_max100_c100_tol5e-3steng-gpu0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492108 |       0.385 |       0.031 |       0.001 |          0.0 |          0.0 | 2.292826 | 2.327742 |
| mnist_linf_10k_zeros_min10_max100_c100_tol5e-3steng-gpu0     | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492344 |       0.394 |       0.032 |       0.001 |          0.0 |          0.0 | 2.298399 |   2.3334 |
| mnist_linf_100k_normal_min10_max100_c1_tol1e-3_steng-gpu_0   | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.496272 |       0.391 |       0.029 |         0.0 |          0.0 |          0.0 | 2.329975 | 2.365457 |
| mnist_linf_100k_normal_min10_max100_c100_tol1e-3_steng-gpu_0 | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495773 |       0.393 |       0.029 |       0.001 |          0.0 |          0.0 | 2.332114 | 2.367628 |
| mnist_linf_100k_normal_min10_max100_c10_tol1e-3_steng-gpu_0  | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495618 |       0.388 |       0.031 |       0.001 |          0.0 |          0.0 | 2.332857 | 2.368383 |
| mnist_linf_100k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0   | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495852 |        0.39 |       0.029 |         0.0 |          0.0 |          0.0 | 2.333477 | 2.369013 |
| mnist_linf_100k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0  | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495721 |       0.394 |       0.031 |         0.0 |          0.0 |          0.0 | 2.333657 | 2.369195 |
| mnist_linf_100k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.496027 |       0.393 |       0.029 |       0.001 |          0.0 |          0.0 | 2.334422 | 2.369972 |
| mnist_linf_10k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0     | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495924 |        0.43 |       0.038 |       0.001 |          0.0 |          0.0 | 2.424029 | 2.460943 |
| mnist_linf_10k_normal_min10_max100_c1_tol1e-3_steng-gpu_0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495679 |       0.431 |       0.035 |       0.001 |          0.0 |          0.0 | 2.426146 | 2.463092 |
| mnist_linf_10k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.496473 |       0.435 |        0.04 |       0.002 |          0.0 |          0.0 | 2.449029 | 2.486323 |
| mnist_linf_10k_normal_min10_max100_c10_tol1e-3_steng-gpu_0   | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.496368 |       0.434 |       0.038 |       0.002 |          0.0 |          0.0 | 2.451946 | 2.489285 |
| mnist_linf_10k_normal_min10_max100_c100_tol1e-3_steng-gpu_0  | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495576 |       0.447 |       0.036 |       0.002 |          0.0 |          0.0 | 2.461558 | 2.499044 |
| mnist_linf_10k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0   | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495901 |       0.448 |        0.04 |       0.002 |          0.0 |          0.0 | 2.469426 | 2.507031 |
| mnist_linf_1k_normal_min10_max100_c1_tol5e-3steng-gpu0       | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.493615 |       0.534 |       0.091 |       0.015 |          0.0 |          0.0 |  2.81475 | 2.857615 |
| mnist_linf_1k_zeros_min10_max100_c1_tol5e-3steng-gpu0        | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.492933 |       0.539 |       0.095 |       0.016 |        0.001 |          0.0 | 2.830421 | 2.873524 |
| mnist_linf_1k_normal_min10_max100_c10_tol5e-3steng-gpu0      | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.490882 |       0.608 |       0.137 |       0.025 |        0.004 |          0.0 | 3.104973 | 3.152257 |
| mnist_linf_1k_zeros_min10_max100_c10_tol5e-3steng-gpu0       | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.491013 |       0.604 |       0.146 |       0.027 |        0.003 |          0.0 | 3.154097 | 3.202129 |
| mnist_linf_1k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0      | 0.355685 | 0.985 | 0.981899 |    0.0 |  0.49376 |       0.634 |       0.139 |       0.019 |        0.001 |          0.0 | 3.191974 | 3.240583 |
| mnist_linf_1k_normal_min10_max100_c1_tol1e-3_steng-gpu_0     | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.495714 |       0.631 |       0.139 |        0.02 |        0.002 |          0.0 | 3.194425 | 3.243071 |
| mnist_linf_1k_normal_min10_max100_c100_tol5e-3steng-gpu0     | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.490744 |       0.613 |       0.182 |       0.054 |        0.017 |        0.005 | 3.379691 | 3.431158 |
| mnist_linf_1k_zeros_min10_max100_c100_tol5e-3steng-gpu0      | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.490014 |       0.626 |       0.199 |       0.054 |        0.021 |        0.002 | 3.474178 | 3.527084 |
| mnist_linf_1k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0     | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.493325 |       0.799 |       0.564 |        0.32 |        0.153 |        0.068 | 6.201742 | 6.296185 |
| mnist_linf_1k_normal_min10_max100_c10_tol1e-3_steng-gpu_0    | 0.355685 | 0.985 | 0.981899 |    0.0 | 0.496143 |       0.795 |       0.588 |       0.332 |        0.155 |        0.084 | 6.417614 | 6.515345 |
| mnist_linf_1k_normal_min10_max100_c100_tol1e-3_steng-gpu_0   | 0.355673 | 0.985 | 0.981898 |    0.0 | 0.494031 |       0.799 |       0.612 |       0.456 |         0.32 |         0.24 | 9.012999 | 9.150252 |
| mnist_linf_1k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0    | 0.355673 | 0.985 | 0.981898 |    0.0 | 0.494629 |        0.81 |       0.631 |       0.489 |        0.349 |        0.263 | 9.159871 | 9.299361 |
|--------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|

|------------------------------------------+----------+-------+--------+------------+------------+------------+-------------+-------------+----------+----------|
| name                                     | nll_loss |   acc | acc_l1 | acc_l1_2.5 | acc_l1_5.0 | acc_l1_7.5 | acc_l1_10.0 | acc_l1_12.5 |       l1 |  l1_corr |
|------------------------------------------+----------+-------+--------+------------+------------+------------+-------------+-------------+----------+----------|
| mnist_linf_1000000_normal_min10_max100_0 | 0.355685 | 0.985 |    0.0 |      0.347 |      0.022 |        0.0 |         0.0 |         0.0 | 2.175229 | 2.208354 |
| mnist_linf_100000_normal_min10_max100_0  | 0.355685 | 0.985 |    0.0 |      0.352 |      0.026 |        0.0 |         0.0 |         0.0 | 2.197227 | 2.230687 |
| mnist_linf_10000_normal_min10_max100_0   | 0.355673 | 0.985 |    0.0 |      0.394 |      0.033 |      0.001 |         0.0 |         0.0 | 2.300429 | 2.335461 |
| mnist_linf_10000_zeros_min10_max100_0    | 0.355673 | 0.985 |    0.0 |      0.389 |       0.03 |      0.001 |         0.0 |         0.0 | 2.301113 | 2.336155 |
|------------------------------------------+----------+-------+--------+------------+------------+------------+-------------+-------------+----------+----------|
*** L-2
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/mnist/test_l1_l2')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [5, 8.75, 12.5, 16.25, 20]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+-----------+-----------|
| name                                                       | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_5.00 | acc_l1_8.75 | acc_l1_12.50 | acc_l1_16.25 | acc_l1_20.00 |        l1 |   l1_corr |
|------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+-----------+-----------|
| mnist_l2_100k_normal_min10_max100_c100_tol5e-3steng-gpu0   |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489378 |       0.886 |       0.664 |        0.344 |        0.128 |        0.035 | 10.853262 | 10.996211 |
| mnist_l2_100k_zeros_min10_max100_c100_tol5e-3steng-gpu0    |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489469 |       0.884 |       0.672 |        0.344 |        0.129 |        0.038 | 10.866124 | 11.009244 |
| mnist_l2_100k_normal_min10_max100_c1_tol5e-3steng-gpu0     |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489538 |       0.887 |        0.67 |        0.347 |        0.133 |        0.037 | 10.877648 | 11.020921 |
| mnist_l2_100k_zeros_min10_max100_c1_tol5e-3steng-gpu0      |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489379 |       0.887 |        0.67 |         0.35 |         0.13 |        0.037 | 10.879738 | 11.023038 |
| mnist_l2_100k_normal_min10_max100_c10_tol5e-3steng-gpu0    |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489739 |       0.885 |       0.671 |        0.349 |        0.133 |        0.039 |  10.88961 |  11.03304 |
| mnist_l2_100k_zeros_min10_max100_c10_tol5e-3steng-gpu0     |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489126 |       0.886 |       0.671 |         0.35 |        0.129 |        0.036 | 10.895295 | 11.038799 |
| mnist_l2_10k_zeros_min10_max100_c100_tol5e-3steng-gpu0     |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489459 |       0.891 |       0.682 |        0.365 |        0.143 |        0.042 | 11.059315 | 11.204979 |
| mnist_l2_100k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0  |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489991 |       0.898 |       0.684 |        0.372 |         0.14 |        0.043 | 11.071306 |  11.21713 |
| mnist_l2_100k_normal_min10_max100_c1_tol1e-3_steng-gpu_0   |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.490048 |       0.899 |       0.684 |        0.374 |         0.14 |        0.041 | 11.083241 | 11.229221 |
| mnist_l2_100k_normal_min10_max100_c100_tol1e-3_steng-gpu_0 |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489808 |       0.898 |       0.682 |         0.37 |        0.144 |        0.044 | 11.088533 | 11.234583 |
| mnist_l2_10k_normal_min10_max100_c100_tol5e-3steng-gpu0    |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489416 |       0.891 |       0.676 |        0.366 |        0.145 |        0.048 | 11.093843 | 11.239963 |
| mnist_l2_10k_normal_min10_max100_c10_tol5e-3steng-gpu0     |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489671 |       0.892 |       0.677 |         0.38 |        0.141 |        0.046 | 11.099035 | 11.245223 |
| mnist_l2_10k_zeros_min10_max100_c10_tol5e-3steng-gpu0      | 0.493558 | 0.987 | 0.957248 |    0.0 | 0.488864 |        0.89 |       0.684 |        0.377 |         0.14 |         0.04 | 11.108231 | 11.254539 |
| mnist_l2_100k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0   |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489646 |       0.896 |       0.682 |        0.378 |        0.145 |        0.043 | 11.109821 | 11.256151 |
| mnist_l2_100k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0    |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.490115 |       0.899 |       0.685 |        0.382 |        0.142 |        0.044 | 11.113758 |  11.26014 |
| mnist_l2_100k_normal_min10_max100_c10_tol1e-3_steng-gpu_0  |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.490161 |       0.899 |       0.683 |        0.387 |         0.14 |        0.043 | 11.119203 | 11.265656 |
| mnist_l2_10k_normal_min10_max100_c1_tol5e-3steng-gpu0      |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489106 |       0.891 |       0.683 |        0.377 |        0.143 |        0.043 |  11.12539 | 11.271926 |
| mnist_l2_10k_zeros_min10_max100_c1_tol5e-3steng-gpu0       |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489183 |       0.892 |        0.69 |        0.372 |        0.144 |        0.041 | 11.136903 | 11.283589 |
| mnist_l2_10k_normal_min10_max100_c100_tol1e-3_steng-gpu_0  |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489704 |         0.9 |       0.695 |        0.395 |        0.155 |        0.051 | 11.308656 | 11.457604 |
| mnist_l2_10k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0   |  0.49356 | 0.987 | 0.957248 |    0.0 |  0.48973 |       0.902 |       0.698 |        0.398 |        0.154 |        0.048 | 11.324006 | 11.473156 |
| mnist_l2_10k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0     | 0.493558 | 0.987 | 0.957248 |    0.0 | 0.490027 |       0.901 |       0.698 |        0.402 |        0.161 |        0.047 | 11.353569 | 11.503112 |
| mnist_l2_10k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0    |  0.49356 | 0.987 | 0.957248 |    0.0 |  0.48968 |       0.902 |       0.697 |        0.407 |         0.16 |        0.047 | 11.357858 | 11.507454 |
| mnist_l2_10k_normal_min10_max100_c10_tol1e-3_steng-gpu_0   |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489606 |       0.902 |       0.697 |        0.407 |        0.155 |        0.048 | 11.358184 | 11.507785 |
| mnist_l2_10k_normal_min10_max100_c1_tol1e-3_steng-gpu_0    |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.490067 |       0.901 |       0.696 |        0.407 |        0.158 |         0.05 | 11.371154 | 11.520926 |
| mnist_l2_1k_normal_min10_max100_c1_tol5e-3steng-gpu0       |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.487903 |       0.899 |       0.701 |        0.437 |         0.18 |        0.059 | 11.664932 | 11.818573 |
| mnist_l2_1k_normal_min10_max100_c10_tol5e-3steng-gpu0      | 0.493558 | 0.987 | 0.957248 |    0.0 | 0.489175 |       0.898 |       0.702 |        0.441 |        0.176 |         0.06 | 11.678082 | 11.831897 |
| mnist_l2_1k_zeros_min10_max100_c1_tol5e-3steng-gpu0        |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.488563 |       0.898 |       0.706 |        0.435 |        0.184 |        0.067 | 11.685676 |  11.83959 |
| mnist_l2_1k_zeros_min10_max100_c10_tol5e-3steng-gpu0       |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.488452 |       0.896 |       0.702 |        0.437 |         0.18 |        0.063 | 11.693916 | 11.847939 |
| mnist_l2_1k_normal_min10_max100_c100_tol5e-3steng-gpu0     | 0.493558 | 0.987 | 0.957248 |    0.0 | 0.489455 |       0.897 |       0.715 |        0.448 |        0.197 |        0.076 | 11.871582 | 12.027946 |
| mnist_l2_1k_zeros_min10_max100_c100_tol5e-3steng-gpu0      |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.488969 |         0.9 |        0.71 |        0.449 |        0.202 |         0.08 | 11.905204 |  12.06201 |
| mnist_l2_1k_normal_min10_max100_c10_tol1e-3_steng-gpu_0    |  0.49356 | 0.987 | 0.957248 |    0.0 |  0.48871 |       0.908 |       0.716 |        0.469 |        0.189 |        0.063 | 11.923567 | 12.080614 |
| mnist_l2_1k_zeros_min10_max100_c100_tol1e-3_steng-gpu_0    | 0.493558 | 0.987 | 0.957248 |    0.0 |  0.48887 |       0.906 |       0.714 |        0.457 |        0.195 |        0.078 | 11.951333 | 12.108747 |
| mnist_l2_1k_zeros_min10_max100_c10_tol1e-3_steng-gpu_0     |  0.49356 | 0.987 | 0.957248 |    0.0 |  0.48853 |       0.909 |       0.712 |        0.462 |        0.189 |         0.07 | 11.955871 | 12.113345 |
| mnist_l2_1k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0      | 0.493558 | 0.987 | 0.957248 |    0.0 | 0.488741 |       0.909 |       0.719 |        0.458 |        0.194 |        0.074 | 11.963767 | 12.121344 |
| mnist_l2_1k_normal_min10_max100_c100_tol1e-3_steng-gpu_0   |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.489586 |       0.906 |       0.718 |        0.453 |        0.197 |        0.076 | 11.964357 | 12.121943 |
| mnist_l2_1k_normal_min10_max100_c1_tol1e-3_steng-gpu_0     |  0.49356 | 0.987 | 0.957248 |    0.0 | 0.488338 |       0.906 |       0.722 |        0.471 |         0.19 |        0.071 |  11.98795 | 12.145846 |
|------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+-----------+-----------|

|------------------------------------------+---------+-------+--------+------------+-------------+-------------+--------------+-------------+-----------+-----------|
| name                                     |     nll |   acc | acc_l1 | acc_l1_5.0 | acc_l1_8.75 | acc_l1_12.5 | acc_l1_16.25 | acc_l1_20.0 |        l1 |   l1_corr |
|------------------------------------------+---------+-------+--------+------------+-------------+-------------+--------------+-------------+-----------+-----------|
| mnist_linf_1000000_normal_min10_max100_0 |     nan | 0.987 |    0.0 |      0.883 |       0.664 |        0.33 |        0.119 |       0.033 | 10.735436 | 10.876836 |
| mnist_linf_100000_zeros_min10_max100_0   | 0.49356 | 0.987 |    0.0 |      0.887 |        0.67 |       0.344 |        0.128 |       0.038 |  10.84979 | 10.992695 |
| mnist_linf_100000_normal_min10_max100_0  |     nan | 0.987 |    0.0 |      0.888 |       0.669 |       0.344 |        0.131 |       0.038 | 10.856825 | 10.999823 |
| mnist_linf_10000_zeros_min10_max100_0    |     nan | 0.987 |    0.0 |      0.893 |       0.673 |       0.368 |        0.144 |       0.049 | 11.110115 | 11.256449 |
| mnist_linf_10000_normal_min10_max100_0   |     nan | 0.987 |    0.0 |      0.892 |       0.686 |       0.371 |        0.143 |       0.046 | 11.120124 | 11.266591 |
|------------------------------------------+---------+-------+--------+------------+-------------+-------------+--------------+-------------+-----------+-----------|
** L2
*** Plain
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l2_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l2_log('./results/mnist/test_l2_plain')
  if len(df) > 0:
      df = df.sort_values('l2_corr', ascending=True)
      thresholds = [0.5, 1, 1.5, 2, 2.5]
      for col in df.columns:
          if col.startswith('acc_l2_') and col not in ['acc_l2_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|--------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|
| name                                                         | nll_loss |   acc |     conf | acc_l2 |  conf_l2 | acc_l2_0.50 | acc_l2_1.00 | acc_l2_1.50 | acc_l2_2.00 | acc_l2_2.50 |       l2 |  l2_corr |  l2_norm |
|--------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|
| mnist_plain_100k_normal_min10_max100_c100_tol5e-3_steng-gpu0 | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.509681 |       0.926 |       0.468 |       0.068 |       0.002 |         0.0 | 0.981581 | 0.997541 | 0.113071 |
| mnist_plain_100k_zeros_min10_max100_c100_tol5e-3_steng-gpu0  | 1.080794 | 0.984 |  0.99489 |    0.0 | 0.509627 |       0.926 |       0.468 |       0.066 |       0.002 |         0.0 | 0.981741 | 0.997704 | 0.113088 |
| mnist_plain_100k_normal_min10_max100_c10_tol5e-3_steng-gpu_0 | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.509449 |       0.926 |       0.468 |        0.07 |       0.002 |         0.0 | 0.981756 |  0.99772 | 0.113091 |
| mnist_plain_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0   | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.509844 |       0.926 |       0.468 |        0.07 |       0.002 |         0.0 | 0.981807 | 0.997771 | 0.113096 |
| mnist_plain_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0  | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.509849 |       0.926 |       0.468 |       0.066 |       0.002 |         0.0 | 0.981868 | 0.997833 | 0.113106 |
| mnist_plain_100k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0  | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.509493 |       0.926 |       0.468 |       0.068 |       0.002 |         0.0 | 0.981963 |  0.99793 | 0.113114 |
| mnist_plain_10k_zeros_min10_max100_c100_tol5e-3_steng-gpu0   | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.511386 |       0.926 |       0.462 |       0.068 |       0.002 |         0.0 | 0.983253 | 0.999241 | 0.113272 |
| mnist_plain_10k_normal_min10_max100_c100_tol5e-3_steng-gpu0  | 1.080803 | 0.984 | 0.994889 |    0.0 |  0.51219 |       0.926 |       0.468 |       0.068 |       0.002 |         0.0 | 0.983403 | 0.999393 | 0.113287 |
| mnist_plain_10k_normal_min10_max100_c10_tol5e-3_steng-gpu_0  | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.511624 |       0.926 |       0.468 |        0.07 |       0.002 |         0.0 | 0.983888 | 0.999886 | 0.113338 |
| mnist_plain_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0    | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.512425 |       0.926 |       0.468 |       0.068 |       0.002 |         0.0 | 0.984426 | 1.000433 | 0.113404 |
| mnist_plain_10k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0   | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.512693 |       0.926 |       0.468 |       0.072 |       0.002 |         0.0 | 0.984472 | 1.000479 | 0.113407 |
| mnist_plain_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0   | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.511895 |       0.926 |        0.47 |        0.07 |       0.002 |         0.0 | 0.984646 | 1.000657 | 0.113434 |
| mnist_plain_1k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0    | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.515245 |       0.926 |       0.474 |       0.072 |       0.002 |         0.0 | 0.989566 | 1.005656 | 0.113986 |
| mnist_plain_1k_normal_min10_max100_c10_tol5e-3_steng-gpu_0   | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.515483 |       0.926 |        0.47 |       0.074 |       0.002 |         0.0 | 0.990553 | 1.006659 | 0.114113 |
| mnist_plain_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0     | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.517839 |       0.926 |       0.476 |       0.078 |       0.004 |         0.0 | 0.991168 | 1.007285 | 0.114174 |
| mnist_plain_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0    | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.517567 |       0.926 |       0.484 |       0.078 |       0.002 |         0.0 | 0.992275 | 1.008409 | 0.114319 |
| mnist_plain_1k_zeros_min10_max100_c100_tol5e-3_steng-gpu0    | 1.080803 | 0.984 | 0.994889 |    0.0 | 0.519972 |       0.942 |       0.584 |       0.164 |       0.006 |         0.0 | 1.093099 | 1.110873 | 0.126096 |
| mnist_plain_1k_normal_min10_max100_c100_tol5e-3_steng-gpu0   | 1.080794 | 0.984 |  0.99489 |    0.0 | 0.518511 |       0.942 |       0.588 |       0.142 |       0.008 |         0.0 | 1.093138 | 1.110913 | 0.126164 |
|--------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|

|-------------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|
| name                                      | nll_loss |   acc | acc_l2 | acc_l2_0.5 | acc_l2_1.0 | acc_l2_1.5 | acc_l2_2.0 | acc_l2_2.5 |       l2 |  l2_norm |  l2_corr | attack_max_iter |
|-------------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|
| mnist_plain_1000000_normal_min10_max100_0 | 1.080794 | 0.984 |    0.0 |      0.926 |      0.462 |      0.068 |      0.002 |        0.0 | 0.979406 | 0.112812 | 0.995332 |         1000000 |
| mnist_plain_100000_normal_min10_max100_0  | 1.080794 | 0.984 |    0.0 |      0.926 |      0.466 |       0.07 |      0.002 |        0.0 | 0.981716 | 0.113087 | 0.997679 |          100000 |
| mnist_plain_10000_zeros_min10_max100_0    | 1.080803 | 0.984 |    0.0 |      0.926 |      0.464 |       0.07 |      0.002 |        0.0 | 0.983299 | 0.113274 | 0.999287 |           10000 |
| mnist_plain_10000_normal_min10_max100_0   | 1.080803 | 0.984 |    0.0 |      0.926 |      0.468 |      0.072 |      0.002 |        0.0 | 0.983637 | 0.113318 | 0.999631 |           10000 |
|-------------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|

*** L-inf
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l2_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l2_log('./results/mnist/test_l2_linf')
  if len(df) > 0:
      df = df.sort_values('l2_corr', ascending=True)
      thresholds = [1, 1.5, 2, 2.5, 3]
      for col in df.columns:
          if col.startswith('acc_l2_') and col not in ['acc_l2_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|-------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|
| name                                                        | nll_loss |   acc |     conf | acc_l2 |  conf_l2 | acc_l2_1.00 | acc_l2_1.50 | acc_l2_2.00 | acc_l2_2.50 | acc_l2_3.00 |       l2 |  l2_corr |  l2_norm |
|-------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|
| mnist_linf_100k_zeros_min10_max100_c100_tol5e-3_steng-gpu0  | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.496319 |       0.586 |        0.07 |         0.0 |         0.0 |         0.0 | 1.030715 | 1.047475 | 0.121372 |
| mnist_linf_100k_normal_min10_max100_c10_tol5e-3_steng-gpu_0 | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.496077 |        0.59 |       0.068 |         0.0 |         0.0 |         0.0 | 1.030886 | 1.047648 | 0.121393 |
| mnist_linf_100k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0  | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.496136 |       0.586 |       0.066 |         0.0 |         0.0 |         0.0 | 1.030956 | 1.047719 | 0.121408 |
| mnist_linf_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0   | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.495718 |       0.588 |       0.068 |         0.0 |         0.0 |         0.0 | 1.031435 | 1.048207 |  0.12146 |
| mnist_linf_100k_normal_min10_max100_c100_tol5e-3_steng-gpu0 | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.496572 |        0.59 |        0.07 |         0.0 |         0.0 |         0.0 | 1.031534 | 1.048307 | 0.121464 |
| mnist_linf_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0  |  0.33926 | 0.984 | 0.981386 |    0.0 | 0.496504 |       0.594 |       0.068 |         0.0 |         0.0 |         0.0 | 1.031817 | 1.048595 | 0.121501 |
| mnist_linf_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0   | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.497273 |       0.608 |       0.082 |         0.0 |         0.0 |         0.0 | 1.046858 |  1.06388 | 0.123384 |
| mnist_linf_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0    | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.496264 |        0.62 |       0.076 |         0.0 |         0.0 |         0.0 | 1.047921 | 1.064961 |  0.12342 |
| mnist_linf_10k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0   | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.496706 |       0.614 |        0.08 |         0.0 |         0.0 |         0.0 | 1.052028 | 1.069134 | 0.124007 |
| mnist_linf_10k_normal_min10_max100_c10_tol5e-3_steng-gpu_0  | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.497318 |       0.626 |       0.078 |         0.0 |         0.0 |         0.0 | 1.052708 | 1.069825 |  0.12413 |
| mnist_linf_10k_normal_min10_max100_c100_tol5e-3_steng-gpu0  | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.497145 |       0.628 |        0.08 |         0.0 |         0.0 |         0.0 | 1.056499 | 1.073678 | 0.124638 |
| mnist_linf_10k_zeros_min10_max100_c100_tol5e-3_steng-gpu0   | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.497398 |       0.634 |       0.082 |       0.002 |         0.0 |         0.0 | 1.060308 | 1.077549 | 0.125011 |
| mnist_linf_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0    | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.500798 |       0.734 |        0.29 |       0.018 |         0.0 |         0.0 | 1.219192 | 1.239016 | 0.144082 |
| mnist_linf_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0     |  0.33926 | 0.984 | 0.981386 |    0.0 | 0.500917 |       0.728 |       0.266 |       0.022 |         0.0 |         0.0 | 1.223141 |  1.24303 | 0.144673 |
| mnist_linf_1k_normal_min10_max100_c10_tol5e-3_steng-gpu_0   | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.502469 |       0.786 |        0.51 |       0.298 |       0.154 |       0.062 | 1.641158 | 1.667844 | 0.195941 |
| mnist_linf_1k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0    | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.502127 |       0.798 |       0.552 |       0.342 |       0.162 |       0.068 | 1.698846 |  1.72647 | 0.203521 |
| mnist_linf_1k_normal_min10_max100_c100_tol5e-3_steng-gpu0   | 0.339271 | 0.984 | 0.981386 |    0.0 | 0.509508 |        0.86 |       0.652 |        0.44 |       0.264 |        0.16 | 2.021849 | 2.054725 | 0.240713 |
| mnist_linf_1k_zeros_min10_max100_c100_tol5e-3_steng-gpu0    |  0.33926 | 0.984 | 0.981386 |    0.0 | 0.509662 |        0.85 |       0.686 |       0.522 |       0.382 |        0.25 | 2.218978 | 2.255059 | 0.263162 |
|-------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|

|------------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|
| name                                     | nll_loss |   acc | acc_l2 | acc_l2_1.0 | acc_l2_1.5 | acc_l2_2.0 | acc_l2_2.5 | acc_l2_3.0 |       l2 |  l2_norm |  l2_corr | attack_max_iter |
|------------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|
| mnist_linf_1000000_normal_min10_max100_0 |  0.33926 | 0.984 |    0.0 |       0.58 |      0.066 |        0.0 |        0.0 |        0.0 | 1.027239 | 0.120949 | 1.043942 |         1000000 |
| mnist_linf_100000_normal_min10_max100_0  |  0.33926 | 0.984 |    0.0 |      0.586 |      0.066 |        0.0 |        0.0 |        0.0 | 1.030972 | 0.121398 | 1.047736 |          100000 |
| mnist_linf_10000_normal_min10_max100_0   | 0.339271 | 0.984 |    0.0 |      0.626 |      0.072 |        0.0 |        0.0 |        0.0 | 1.056513 | 0.124585 | 1.073692 |           10000 |
| mnist_linf_10000_zeros_min10_max100_0    |  0.33926 | 0.984 |    0.0 |      0.638 |       0.08 |        0.0 |        0.0 |        0.0 | 1.058097 | 0.124813 | 1.075302 |           10000 |
|------------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|

*** L-2
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l2_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l2_log('./results/mnist/test_l2_l2')
  if len(df) > 0:
      df = df.sort_values('l2_corr', ascending=True)
      thresholds = [1, 1.5, 2, 2.5, 3]
      for col in df.columns:
          if col.startswith('acc_l2_') and col not in ['acc_l2_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|-----------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|
| name                                                      | nll_loss |   acc |     conf | acc_l2 |  conf_l2 | acc_l2_1.00 | acc_l2_1.50 | acc_l2_2.00 | acc_l2_2.50 | acc_l2_3.00 |       l2 |  l2_corr |  l2_norm |
|-----------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|
| mnist_l2_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0  | 0.495731 | 0.986 |   0.9574 |    0.0 |  0.49214 |       0.924 |       0.826 |       0.658 |       0.366 |       0.078 | 2.161465 | 2.192155 | 0.253569 |
| mnist_l2_100k_normal_min10_max100_c100_tol5e-3_steng-gpu0 | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491988 |       0.924 |       0.826 |       0.658 |       0.368 |       0.084 | 2.162127 | 2.192826 | 0.253671 |
| mnist_l2_100k_normal_min10_max100_c10_tol5e-3_steng-gpu_0 | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.492029 |       0.924 |       0.826 |       0.658 |       0.362 |       0.078 | 2.162272 | 2.192974 |  0.25368 |
| mnist_l2_100k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0  | 0.495727 | 0.986 | 0.957399 |    0.0 | 0.492002 |       0.924 |       0.826 |       0.656 |       0.364 |       0.082 | 2.162388 | 2.193092 | 0.253763 |
| mnist_l2_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0   | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.492334 |       0.924 |       0.826 |       0.662 |       0.368 |       0.078 | 2.162501 | 2.193206 |  0.25372 |
| mnist_l2_100k_zeros_min10_max100_c100_tol5e-3_steng-gpu0  | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491881 |       0.924 |       0.826 |        0.66 |       0.366 |       0.078 | 2.162762 |  2.19347 | 0.253705 |
| mnist_l2_10k_normal_min10_max100_c100_tol5e-3_steng-gpu0  | 0.495731 | 0.986 |   0.9574 |    0.0 |  0.49203 |       0.924 |       0.828 |       0.664 |       0.382 |       0.088 | 2.181392 | 2.212365 | 0.255994 |
| mnist_l2_10k_zeros_min10_max100_c100_tol5e-3_steng-gpu0   | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.492045 |       0.924 |        0.83 |       0.664 |        0.38 |       0.092 | 2.181778 | 2.212757 | 0.256055 |
| mnist_l2_10k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0   | 0.495727 | 0.986 | 0.957399 |    0.0 | 0.491946 |       0.924 |        0.83 |       0.664 |       0.382 |       0.092 | 2.181997 | 2.212979 | 0.256031 |
| mnist_l2_10k_normal_min10_max100_c10_tol5e-3_steng-gpu_0  | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491972 |       0.924 |       0.828 |       0.664 |       0.384 |        0.09 | 2.182322 | 2.213309 | 0.256127 |
| mnist_l2_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0   | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491867 |       0.924 |        0.83 |       0.664 |       0.382 |        0.09 | 2.182355 | 2.213341 | 0.256202 |
| mnist_l2_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0    | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491711 |       0.924 |        0.83 |       0.666 |       0.386 |       0.086 | 2.185028 | 2.216053 | 0.256556 |
| mnist_l2_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0    | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491573 |       0.928 |       0.838 |        0.68 |       0.406 |       0.108 | 2.216344 | 2.247814 | 0.260284 |
| mnist_l2_1k_normal_min10_max100_c10_tol5e-3_steng-gpu_0   | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.491726 |       0.926 |        0.84 |        0.68 |       0.406 |       0.106 |  2.21695 | 2.248427 |  0.26023 |
| mnist_l2_1k_normal_min10_max100_c100_tol5e-3_steng-gpu0   | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.492411 |       0.926 |       0.838 |       0.678 |       0.396 |       0.114 | 2.217399 | 2.248883 | 0.260145 |
| mnist_l2_1k_zeros_min10_max100_c10_tol5e-3_steng-gpu_0    | 0.495731 | 0.986 |   0.9574 |    0.0 | 0.492047 |       0.928 |       0.832 |       0.676 |       0.404 |       0.112 | 2.218074 | 2.249568 | 0.260427 |
| mnist_l2_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0     | 0.495731 | 0.986 |   0.9574 |    0.0 |  0.49141 |       0.928 |       0.838 |       0.678 |       0.402 |       0.112 | 2.219469 | 2.250983 | 0.260718 |
| mnist_l2_1k_zeros_min10_max100_c100_tol5e-3_steng-gpu0    | 0.495731 | 0.986 |   0.9574 |    0.0 |  0.49277 |       0.928 |       0.836 |       0.678 |       0.418 |       0.108 | 2.224176 | 2.255757 | 0.261218 |
|-----------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------+----------|

|----------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|
| name                                   | nll_loss |   acc | acc_l2 | acc_l2_1.0 | acc_l2_1.5 | acc_l2_2.0 | acc_l2_2.5 | acc_l2_3.0 |       l2 |  l2_norm |  l2_corr | attack_max_iter |
|----------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|
| mnist_l2_1000000_normal_min10_max100_0 | 0.495731 | 0.986 |    0.0 |      0.924 |      0.826 |      0.656 |       0.35 |      0.076 |  2.15069 | 0.252187 | 2.181227 |         1000000 |
| mnist_l2_100000_normal_min10_max100_0  | 0.495727 | 0.986 |    0.0 |      0.924 |      0.826 |      0.662 |      0.368 |      0.078 | 2.162341 | 0.253724 | 2.193043 |          100000 |
| mnist_l2_10000_normal_min10_max100_0   | 0.495731 | 0.986 |    0.0 |      0.924 |      0.826 |      0.666 |      0.386 |      0.088 | 2.181619 | 0.255984 | 2.212595 |           10000 |
| mnist_l2_10000_zeros_min10_max100_0    | 0.495727 | 0.986 |    0.0 |      0.924 |      0.828 |      0.668 |      0.386 |      0.088 | 2.183283 | 0.256249 | 2.214283 |           10000 |
|----------------------------------------+----------+-------+--------+------------+------------+------------+------------+------------+----------+----------+----------+-----------------|

* Cifar10
** L1
*** Plain
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/cifar10/test_l1_plain',
                                   exclude=['nll_loss', 'conf'])
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [2, 4, 6, 8, 10]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in [
                  'acc_l1_%.2f' % th for th in thresholds
          ]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|---------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| name                                                                |   acc | acc_l1 |  conf_l2 | acc_l1_2.00 | acc_l1_4.00 | acc_l1_6.00 | acc_l1_8.00 | acc_l1_10.00 |       l1 |  l1_corr |
|---------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| cifar10_plain_100k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.559871 |       0.533 |       0.211 |       0.064 |       0.015 |        0.006 | 2.509731 | 2.807305 |
| cifar10_plain_100k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.558449 |       0.536 |       0.214 |       0.064 |       0.014 |        0.006 | 2.514431 | 2.812563 |
| cifar10_plain_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0       | 0.894 |    0.0 | 0.559348 |       0.534 |       0.212 |       0.065 |       0.015 |        0.006 | 2.517505 | 2.816001 |
| cifar10_plain_100k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.556516 |       0.538 |       0.214 |       0.064 |       0.014 |        0.006 | 2.518536 | 2.817154 |
| cifar10_plain_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0        | 0.894 |    0.0 |  0.56022 |       0.536 |       0.211 |       0.065 |       0.015 |        0.006 | 2.524347 | 2.823655 |
| cifar10_plain_100k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0 | 0.894 |    0.0 | 0.557927 |       0.532 |       0.213 |       0.064 |       0.013 |        0.006 | 2.525108 | 2.824505 |
| cifar10_plain_10k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 0.894 |    0.0 | 0.567196 |       0.551 |       0.223 |       0.072 |       0.016 |        0.006 |  2.59849 | 2.906588 |
| cifar10_plain_10k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.568218 |       0.546 |       0.231 |       0.072 |       0.018 |        0.006 | 2.606505 | 2.915554 |
| cifar10_plain_10k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.565762 |       0.552 |       0.228 |        0.07 |       0.015 |        0.006 | 2.611103 | 2.920696 |
| cifar10_plain_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0         | 0.894 |    0.0 | 0.568913 |       0.549 |       0.228 |       0.074 |       0.017 |        0.006 | 2.612788 | 2.922582 |
| cifar10_plain_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0        | 0.894 |    0.0 | 0.565418 |        0.55 |       0.233 |       0.073 |       0.018 |        0.006 |  2.61464 | 2.924653 |
| cifar10_plain_10k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.566521 |       0.551 |       0.228 |       0.075 |       0.016 |        0.006 | 2.616954 | 2.927242 |
| cifar10_plain_1k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0     | 0.894 |    0.0 | 0.575973 |       0.572 |        0.26 |       0.086 |       0.023 |        0.007 | 2.736855 | 3.061359 |
| cifar10_plain_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0          | 0.894 |    0.0 | 0.579711 |       0.574 |       0.246 |       0.084 |       0.021 |        0.007 | 2.754455 | 3.081046 |
| cifar10_plain_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0         | 0.894 |    0.0 |  0.57682 |       0.573 |       0.262 |       0.086 |       0.024 |        0.007 | 2.758035 |  3.08505 |
| cifar10_plain_1k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 0.894 |    0.0 | 0.577158 |        0.57 |        0.27 |       0.091 |       0.023 |        0.007 | 2.765924 | 3.093874 |
| cifar10_plain_1k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0    | 0.894 |    0.0 | 0.581643 |       0.671 |       0.347 |       0.143 |       0.048 |        0.018 | 3.315459 | 3.708567 |
| cifar10_plain_1k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.578963 |       0.677 |        0.37 |       0.135 |       0.042 |        0.012 |  3.35475 | 3.752517 |
|---------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|

|----------------------------------------------+----------+-------+---------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| name                                         | nll_loss |   acc |    conf | acc_l1 |  conf_l1 | acc_l1_2.00 | acc_l1_4.00 | acc_l1_6.00 | acc_l1_8.00 | acc_l1_10.00 |       l1 |  l1_corr |
|----------------------------------------------+----------+-------+---------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| cifar10_plain_100k_zeros_min10_max100_c10_0  | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.559081 |       0.533 |       0.209 |       0.065 |       0.014 |        0.006 | 2.507072 | 2.804332 |
| cifar10_plain_100k_normal_min10_max100_c10_0 | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.559759 |       0.537 |       0.212 |       0.066 |       0.015 |        0.006 | 2.514471 | 2.812607 |
| cifar10_plain_100k_zeros_min10_max100_0      | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.557824 |       0.532 |       0.209 |       0.064 |       0.015 |        0.006 | 2.516497 | 2.814873 |
| cifar10_plain_10k_zeros_min10_max100_c10_0   | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.567616 |       0.549 |       0.228 |       0.073 |       0.016 |        0.006 | 2.601036 | 2.909436 |
| cifar10_plain_10k_normal_min10_max100_c10_0  | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.567952 |       0.551 |       0.228 |       0.073 |        0.02 |        0.006 | 2.603428 | 2.912112 |
| cifar10_plain_10k_zeros_min10_max100_0       | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.565234 |        0.55 |       0.231 |       0.075 |       0.016 |        0.006 | 2.611093 | 2.920686 |
| cifar10_plain_10k_normal_min10_max100_0      | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.566654 |       0.553 |        0.23 |       0.071 |       0.016 |        0.005 | 2.618411 | 2.928871 |
| cifar10_plain_1k_zeros_min10_max100_c10_0    | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.579383 |       0.571 |        0.26 |       0.091 |       0.025 |        0.008 | 2.768108 | 3.096318 |
| cifar10_plain_1k_normal_min10_max100_c10_0   | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.576317 |       0.571 |       0.264 |        0.09 |       0.026 |        0.007 | 2.771025 | 3.099581 |
| cifar10_plain_1k_zeros_min10_max100_0        | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.580204 |        0.67 |       0.345 |       0.134 |       0.048 |        0.014 | 3.289966 | 3.680052 |
| cifar10_plain_1k_normal_min10_max100_0       | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.581259 |       0.679 |       0.364 |       0.141 |       0.047 |        0.014 | 3.367019 | 3.766241 |
|----------------------------------------------+----------+-------+---------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|

*** L-inf
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/cifar10/test_l1_linf')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [5, 8.75, 12.5, 16.25, 20]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|--------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+----------+----------|
| name                                                               | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_5.00 | acc_l1_8.75 | acc_l1_12.50 | acc_l1_16.25 | acc_l1_20.00 |       l1 |  l1_corr |
|--------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+----------+----------|
| cifar10_linf_100k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.587436 |       0.331 |       0.142 |        0.056 |         0.02 |        0.003 | 4.158229 | 5.171926 |
| cifar10_linf_100k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0 | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.587241 |       0.329 |       0.143 |        0.058 |         0.02 |        0.002 | 4.163188 | 5.178095 |
| cifar10_linf_100k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0  | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.587927 |       0.328 |       0.146 |        0.056 |        0.019 |        0.003 | 4.170213 | 5.186832 |
| cifar10_linf_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0       | 1.586139 | 0.804 | 0.975138 |    0.0 |  0.58787 |        0.33 |       0.146 |        0.052 |        0.021 |        0.002 | 4.177831 | 5.196307 |
| cifar10_linf_10k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.591271 |       0.346 |       0.157 |         0.06 |        0.023 |        0.007 | 4.329201 | 5.384579 |
| cifar10_linf_10k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591974 |       0.344 |       0.155 |        0.062 |        0.021 |        0.004 |  4.33254 | 5.388731 |
| cifar10_linf_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.590956 |       0.346 |       0.155 |        0.061 |        0.023 |        0.005 | 4.337943 | 5.395452 |
| cifar10_linf_10k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.591554 |       0.346 |       0.162 |        0.061 |        0.021 |        0.005 | 4.340805 | 5.399012 |
| cifar10_linf_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591559 |       0.348 |        0.16 |        0.063 |        0.019 |        0.004 | 4.349982 | 5.410426 |
| cifar10_linf_10k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591523 |       0.343 |       0.155 |        0.061 |        0.024 |        0.006 | 4.364141 | 5.428036 |
| cifar10_linf_1k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.596123 |       0.372 |       0.187 |        0.079 |        0.031 |        0.009 |  4.70956 | 5.857662 |
| cifar10_linf_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.597622 |        0.38 |       0.189 |         0.08 |        0.035 |        0.012 | 4.753375 | 5.912157 |
| cifar10_linf_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0          | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.598191 |       0.379 |       0.193 |        0.075 |        0.032 |         0.01 | 4.765176 | 5.926836 |
| cifar10_linf_1k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0     | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.597183 |        0.38 |       0.192 |        0.083 |        0.033 |        0.009 | 4.765954 | 5.927804 |
| cifar10_linf_1k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.594551 |       0.404 |       0.205 |        0.109 |        0.048 |        0.025 | 5.279621 | 6.566692 |
| cifar10_linf_1k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0    | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.596044 |       0.402 |       0.221 |        0.103 |        0.051 |        0.022 | 5.299309 |  6.59118 |
|--------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+----------+----------|

*** L-2
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/cifar10/test_l1_l2')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [3, 6, 9, 12, 15]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| name                                                             | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_3.00 | acc_l1_6.00 | acc_l1_9.00 | acc_l1_12.00 | acc_l1_15.00 |       l1 |  l1_corr |
|------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| cifar10_l2_100k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0 | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.588975 |       0.629 |       0.427 |       0.254 |        0.148 |        0.078 |  6.00457 | 7.440607 |
| cifar10_l2_10k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593604 |       0.635 |       0.444 |       0.259 |        0.161 |         0.09 | 6.221211 | 7.709059 |
| cifar10_l2_10k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593652 |       0.634 |       0.439 |       0.269 |        0.164 |        0.092 | 6.248112 | 7.742394 |
| cifar10_l2_1k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.597689 |       0.672 |       0.493 |       0.327 |        0.219 |        0.136 | 7.249588 |  8.98338 |
| cifar10_l2_1k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.595898 |       0.677 |         0.5 |       0.329 |        0.218 |        0.137 | 7.351001 | 9.109047 |
|------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|

|-------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| name                                      | nll_loss |   acc |     conf | acc_l1 |  conf_l1 | acc_l1_3.00 | acc_l1_6.00 | acc_l1_9.00 | acc_l1_12.00 | acc_l1_15.00 |       l1 |  l1_corr |
|-------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| cifar10_l2_100k_zeros_min10_max100_c10_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.589365 |        0.63 |       0.421 |       0.251 |        0.149 |        0.081 | 5.993164 | 7.426474 |
| cifar10_l2_100k_normal_min10_max100_c10_0 | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.587929 |       0.628 |       0.425 |       0.252 |        0.146 |        0.083 | 5.993952 | 7.427449 |
| cifar10_linf_100k_zeros_min10_max100_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.589398 |       0.628 |       0.424 |       0.254 |        0.146 |         0.08 | 5.999459 | 7.434275 |
| cifar10_linf_10k_normal_min10_max100_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593449 |       0.636 |       0.443 |       0.264 |        0.161 |        0.088 | 6.222314 | 7.710427 |
| cifar10_l2_10k_normal_min10_max100_c10_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593879 |       0.636 |       0.445 |       0.267 |        0.162 |        0.089 | 6.228924 | 7.718617 |
| cifar10_l2_10k_zeros_min10_max100_c10_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.594251 |       0.635 |       0.444 |       0.267 |        0.158 |        0.091 | 6.229979 | 7.719925 |
| cifar10_linf_10k_zeros_min10_max100_0     | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.593216 |       0.633 |       0.444 |       0.265 |        0.162 |         0.09 | 6.237856 | 7.729685 |
| cifar10_l2_1k_zeros_min10_max100_c10_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.599375 |        0.64 |       0.466 |       0.296 |        0.188 |        0.117 | 6.697077 | 8.298733 |
| cifar10_l2_1k_normal_min10_max100_c10_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.599301 |       0.644 |       0.471 |       0.295 |        0.189 |        0.113 | 6.720698 | 8.328002 |
| cifar10_linf_1k_zeros_min10_max100_0      | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.598177 |       0.674 |       0.488 |        0.33 |        0.218 |        0.142 | 7.277662 | 9.018168 |
| cifar10_linf_1k_normal_min10_max100_0     | 1.539493 | 0.807 | 0.973637 |    0.0 |  0.59651 |       0.675 |       0.493 |       0.337 |        0.217 |        0.131 | 7.326252 |  9.07838 |
|-------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|

** TODO L2
* ImageNet

* COMMENT Local Variables
# Local Variables:
# org-download-image-dir: "img/work"
# org-confirm-babel-evaluate: nil
# End:
